In [58]:
from datetime import datetime, timedelta
from calendar import mdays
import pandas as pd

current_date= datetime.now()
print(current_date)

2020-04-26 10:26:05.132521

In [6]:
current_date.date

In [7]:
my_string = '2019-10-31'

# Create date object in given time format yyyy-mm-dd
my_date = datetime.strptime(my_string, "%Y-%m-%d")

print(my_date)
print('Type: ',type(my_date))

2019-10-31 00:00:00
Type:  <class 'datetime.datetime'>

In [12]:
print(my_date)

2019-10-31 00:00:00

In [14]:
current_date.strftime("%d/%m/%Y")

'26/04/2020'

In [16]:
current_date.strftime("%H:%M:%S")

'09:15:09'

In [22]:
print(current_date + timedelta(10))

2020-05-06 09:23:49.111848

In [28]:
# Saturday January 27, 2020

date_data_one = ['Saturday January 27, 2020', 'Saturday December 2, 2020']
date_data_one = pd.to_datetime(date_data_one, format="%A %B %d, %Y")
print(date_data_one)

DatetimeIndex(['2020-01-27', '2020-12-02'], dtype='datetime64[ns]', freq=None)

In [29]:
# Saturday January 27, 2017
date_data_one = pd.to_datetime(date_data_one, format="%A %B %d, %Y")
print(date_data_one)

DatetimeIndex(['2020-01-27', '2020-12-02'], dtype='datetime64[ns]', freq=None)

In [30]:
date_data_two = ['2017-01-01', '2016-05-03']
date_data_two = pd.to_datetime(date_data_two, format="%Y-%m-%d")
print(date_data_two)

DatetimeIndex(['2017-01-01', '2016-05-03'], dtype='datetime64[ns]', freq=None)

In [31]:
date_data_four = ['2016 March 01 01:56', '2016 January 4 02:16']
date_data_four = pd.to_datetime(date_data_four, format="%Y %B %d %H:%M")
print(date_data_four)

DatetimeIndex(['2016-03-01 01:56:00', '2016-01-04 02:16:00'], dtype='datetime64[ns]', freq=None)

In [123]:
purchase = pd.read_csv('./Downloads/data/purchase_data_v1.csv')
purchase.head()

         date       uid            sku  price
0  2017-07-10  41195147  sku_three_499    499
1  2017-07-15  41195147  sku_three_499    499
2  2017-11-12  41195147   sku_four_599    599
3  2017-09-26  91591874    sku_two_299    299
4  2017-12-01  91591874   sku_four_599    599

In [124]:
customers = pd.read_csv('./Downloads/data/user_demographics_v1.csv')
customers

             uid              reg_date device gender country  age
0     54030035.0  2017-06-29T00:00:00Z    and      M     USA   19
1     72574201.0  2018-03-05T00:00:00Z    iOS      F     TUR   22
2     64187558.0  2016-02-07T00:00:00Z    iOS      M     USA   16
3     92513925.0  2017-05-25T00:00:00Z    and      M     BRA   41
4     99231338.0  2017-03-26T00:00:00Z    iOS      M     FRA   59
...          ...                   ...    ...    ...     ...  ...
9995  43138741.0  2016-11-23T00:00:00Z    and      M     BRA   16
9996  30326568.0  2016-08-21T00:00:00Z    and      M     BRA   15
9997  92384369.0  2015-08-20T00:00:00Z    and      F     DEU   33
9998  98809962.0  2017-04-08T00:00:00Z    iOS      F     FRA   32
9999  82078268.0  2018-02-23T00:00:00Z    and      F     CAN   31

[10000 rows x 6 columns]

In [125]:
user_purchases = pd.merge(customers, purchase)
user_purchases.head()

,uid,reg_date,device,gender,country,age,date,sku,price
0,92513925.0,2017-05-25T00:00:00Z,and,M,BRA,41,2017-10-20,sku_three_499,499
1,92513925.0,2017-05-25T00:00:00Z,and,M,BRA,41,2017-05-29,sku_two_299,299
2,92513925.0,2017-05-25T00:00:00Z,and,M,BRA,41,2017-08-23,sku_four_599,599
3,92513925.0,2017-05-25T00:00:00Z,and,M,BRA,41,2018-03-26,sku_six_1299,299
4,16377492.0,2016-10-16T00:00:00Z,and,M,BRA,20,2018-03-17,sku_one_199,199

In [133]:
user_purchases[['reg_date','date']]= user_purchases[['reg_date','date']].apply(lambda x: pd.to_datetime(x)) 

# get date only column
#user_purchases['reg_date'] = user_purchases['reg_date'].dt.date
user_purchases.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9006 entries, 0 to 9005
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   uid       9006 non-null   float64
 1   reg_date  9006 non-null   datetime64[ns, UTC]
 2   device    9006 non-null   object
 3   gender    9006 non-null   object
 4   country   9006 non-null   object
 5   age       9006 non-null   int64
 6   date      9006 non-null   datetime64[ns]
 7   sku       9006 non-null   object
 8   price     9006 non-null   int64
dtypes: datetime64[ns, UTC](1), datetime64[ns](1), float64(1), int64(2), object(4)
memory usage: 703.6+ KB

In [134]:
user_purchases.head()

,uid,reg_date,device,gender,country,age,date,sku,price
0,92513925.0,2017-05-25 00:00:00+00:00,and,M,BRA,41,2017-10-20,sku_three_499,499
1,92513925.0,2017-05-25 00:00:00+00:00,and,M,BRA,41,2017-05-29,sku_two_299,299
2,92513925.0,2017-05-25 00:00:00+00:00,and,M,BRA,41,2017-08-23,sku_four_599,599
3,92513925.0,2017-05-25 00:00:00+00:00,and,M,BRA,41,2018-03-26,sku_six_1299,299
4,16377492.0,2016-10-16 00:00:00+00:00,and,M,BRA,20,2018-03-17,sku_one_199,199

### How to get a next date after a month

In [86]:
from datetime import date, timedelta

def last_day_in_month(a_date, months_forward = 0):
    month_index = a_date.year * 12 + a_date.month + months_forward
    y = month_index // 12
    m = (month_index % 12) + 1
    return date(y, m, 1) - timedelta(1)

def add_month(a_date, months = 1):
    is_last_day = a_date == last_day_in_month(a_date)
    last_in_target_month = last_day_in_month(a_date, months)
    if is_last_day or a_date.day > last_in_target_month.day:
        return last_in_target_month
    else:
        return last_in_target_month.replace(day = a_date.day)

### Now when can get the next month of the same date`

In [135]:
user_purchases['expired_trial'] = user_purchases['reg_date'].apply(lambda x: add_month(x))
user_purchases['expired_trial'] = pd.to_datetime(user_purchases['expired_trial'])

### Create a flag that indicates who makes a first purchase within a month

In [136]:
user_purchases[['date','expired_trial']].head()

        date expired_trial
0 2017-10-20    2017-06-25
1 2017-05-29    2017-06-25
2 2017-08-23    2017-06-25
3 2018-03-26    2017-06-25
4 2018-03-17    2016-11-16

In [137]:
user_purchases.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9006 entries, 0 to 9005
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   uid            9006 non-null   float64
 1   reg_date       9006 non-null   datetime64[ns, UTC]
 2   device         9006 non-null   object
 3   gender         9006 non-null   object
 4   country        9006 non-null   object
 5   age            9006 non-null   int64
 6   date           9006 non-null   datetime64[ns]
 7   sku            9006 non-null   object
 8   price          9006 non-null   int64
 9   expired_trial  9006 non-null   datetime64[ns]
dtypes: datetime64[ns, UTC](1), datetime64[ns](2), float64(1), int64(2), object(4)
memory usage: 774.0+ KB

In [138]:
user_purchases= user_purchases.assign(first_week_purchase =lambda x: (user_purchases['expired_trial'] > user_purchases['date']).astype(int))
user_purchases.head()

,uid,reg_date,device,gender,country,age,date,sku,price,expired_trial,first_week_purchase
0,92513925.0,2017-05-25 00:00:00+00:00,and,M,BRA,41,2017-10-20,sku_three_499,499,2017-06-25,0
1,92513925.0,2017-05-25 00:00:00+00:00,and,M,BRA,41,2017-05-29,sku_two_299,299,2017-06-25,1
2,92513925.0,2017-05-25 00:00:00+00:00,and,M,BRA,41,2017-08-23,sku_four_599,599,2017-06-25,0
3,92513925.0,2017-05-25 00:00:00+00:00,and,M,BRA,41,2018-03-26,sku_six_1299,299,2017-06-25,0
4,16377492.0,2016-10-16 00:00:00+00:00,and,M,BRA,20,2018-03-17,sku_one_199,199,2016-11-16,0

**Filter this dataset to only include purchases that occurred on a date within the first 28 days. Recall that the date of purchase is stored in the date column.**

**Note**: since column reg_date indicates timezone UTC, we may need to convert datetime into UTC time zone with**tx_localize** to avoid error:

Cannot compare tz-naive and tz-aware timestamps error
eg:
pd.to_datetime('2015-01-01').tz_localize('US/Eastern') instead of naive dates such as datetime(2015, 1, 1, 0, 0, 0)

In [142]:
# Compute max_purchase_date
max_purchase_date = pd.to_datetime('2017-05-20').tz_localize('UTC') - timedelta(days=28)

# Filter to only include users who registered before our max date
purchase_data_filt = user_purchases[user_purchases.reg_date < max_purchase_date]
purchase_data_filt

,uid,reg_date,device,gender,country,age,date,sku,price,expired_trial,first_week_purchase
4,16377492.0,2016-10-16 00:00:00+00:00,and,M,BRA,20,2018-03-17,sku_one_199,199,2016-11-16,0
5,16377492.0,2016-10-16 00:00:00+00:00,and,M,BRA,20,2017-02-06,sku_three_499,499,2016-11-16,0
6,16377492.0,2016-10-16 00:00:00+00:00,and,M,BRA,20,2017-03-01,sku_seven_1499,499,2016-11-16,0
7,36350096.0,2017-04-07 00:00:00+00:00,and,M,USA,23,2017-04-21,sku_seven_1499,499,2017-05-07,1
8,36350096.0,2017-04-07 00:00:00+00:00,and,M,USA,23,2017-06-04,sku_three_499,499,2017-05-07,0
...,...,...,...,...,...,...,...,...,...,...,...
8998,90783242.0,2016-10-07 00:00:00+00:00,and,M,BRA,17,2017-10-11,sku_five_899,899,2016-11-07,0
8999,90783242.0,2016-10-07 00:00:00+00:00,and,M,BRA,17,2017-10-27,sku_four_599,599,2016-11-07,0
9000,90783242.0,2016-10-07 00:00:00+00:00,and,M,BRA,17,2018-01-04,sku_one_199,199,2016-11-07,0
9001,91591874.0,2017-01-05 00:00:00+00:00,and,M,TUR,17,2017-09-26,sku_two_299,299,2017-02-05,0
9002,91591874.0,2017-01-05 00:00:00+00:00,and,M,TUR,17,2017-12-01,sku_four_599,599,2017-02-05,0

In [151]:
user_purchases.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9006 entries, 0 to 9005
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   uid                  9006 non-null   float64
 1   reg_date             9006 non-null   datetime64[ns, UTC]
 2   device               9006 non-null   object
 3   gender               9006 non-null   object
 4   country              9006 non-null   object
 5   age                  9006 non-null   int64
 6   date                 9006 non-null   datetime64[ns]
 7   sku                  9006 non-null   object
 8   price                9006 non-null   int64
 9   expired_trial        9006 non-null   datetime64[ns]
 10  first_week_purchase  9006 non-null   int64
dtypes: datetime64[ns, UTC](1), datetime64[ns](2), float64(1), int64(3), object(4)
memory usage: 844.3+ KB

To ease the calculation, we may want to remove timezone

In [155]:
user_purchases.reg_date =user_purchases.reg_date.dt.tz_localize(None)

In [156]:
user_purchases.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9006 entries, 0 to 9005
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   uid                  9006 non-null   float64
 1   reg_date             9006 non-null   datetime64[ns]
 2   device               9006 non-null   object
 3   gender               9006 non-null   object
 4   country              9006 non-null   object
 5   age                  9006 non-null   int64
 6   date                 9006 non-null   datetime64[ns]
 7   sku                  9006 non-null   object
 8   price                9006 non-null   int64
 9   expired_trial        9006 non-null   datetime64[ns]
 10  first_week_purchase  9006 non-null   int64
dtypes: datetime64[ns](3), float64(1), int64(3), object(4)
memory usage: 844.3+ KB